#include "Scene_Select.h"

//============================================================================
//	Scene_Select classMethods
//============================================================================

Scene_Select::Scene_Select() {
}

Scene_Select::~Scene_Select() {
}

void Scene_Select::Initialize() {

    //============================================================================
    //	engine
    //============================================================================

    SEED::SetMainCamera("default");
    SEED::SetSkyBox("DefaultAssets/CubeMaps/rostock_laage_airport_4k.dds");

    //============================================================================
    //	objects
    //============================================================================

    // 背景初期化
    background_ = std::make_unique<SelectBackground>();
    background_->Initialize();
}

void Scene_Select::Update() {

    //============================================================================
    //	objects
    //============================================================================

    // 背景更新
    background_->Update();

    //============================================================================
    //	sceneEvenets
    //============================================================================

    if (Input::IsTriggerPadButton(PAD_BUTTON::A)) {
        ChangeScene("Game");
    }

    if (Input::IsTriggerPadButton(PAD_BUTTON::B)) {
        ChangeScene("Title");
    }
}

void Scene_Select::Draw() {

    //============================================================================
    //	objects
    //============================================================================

    // 背景描画
    background_->Draw();
}

//============================================================================
//	Scene_Select frame:Begin
//============================================================================

void Scene_Select::BeginFrame() {

    // ヒエラルキー内のオブジェクトの描画
    hierarchy_->BeginFrame();
}
//============================================================================
//	Scene_Select frame:End
//============================================================================

void Scene_Select::EndFrame() {

    // ヒエラルキー内のオブジェクトのフレーム終了処理
    hierarchy_->EndFrame();
}