#include <GameState_Play.h>

// local
#include <SEED.h>
#include <includes.h>
#include <ShapeMath.h>
#include <Environment.h>
#include "Easing.h"

// scene,state
#include <SceneManager.h>
#include <Scene_Clear.h>
#include <Scene_Game.h>
#include <GameState_Exit.h>
#include <GameState_Enter.h>

// external
#define IMGUI_DEFINE_MATH_OPERATORS
#include <ImGui.h>
#include <random>
#include <cmath>
#include <algorithm>



/*==================================================================================================*/
/*                                      コンストラクタ：デストラクタ                                    */
/*==================================================================================================*/

GameState_Play::GameState_Play(Scene_Game* pScene) : State_Base(pScene){

}


void GameState_Play::Initialize(){
}


/*------------------------デストラクタ---------------------------*/

GameState_Play::~GameState_Play(){}


/*==================================================================================================*/
/*                                             更新処理                                              */
/*==================================================================================================*/


////////////////////////////////////////////////////////////////////////////
//                          全部まとめた更新処理                             //
////////////////////////////////////////////////////////////////////////////

void GameState_Play::Update(){
}


/*==================================================================================================*/
/*                                             描画処理                                              */
/*==================================================================================================*/


void GameState_Play::Draw(){}



/*==================================================================================================*/
/*                                            その他関数                                              */
/*==================================================================================================*/
