#pragma once

//============================================================================
//	include
//============================================================================

//============================================================================
//	StageObjectType enum class
//============================================================================

// オブジェクトの種類
enum class StageObjectType {

    Empty = 0,       // 空白
    NormalBlock = 1, // 通常ブロック
    Goal = 2,        // ゴール
    Player = 3,      // プレイヤー
    Warp = 4,        // ワープ
};

// 共通の状態
enum class StageObjectCommonState {

    None,    // 通常状態
    Hologram // ホログラム状態(コピー後のオブジェクト)
};